rmalchow/ondaire/esp32/sdkconfig.defaults.esp32s3-loud
# Sonocotta Loud-ESP32-S3 — ESP32-S3-WROOM-1 audio-dock carrier, dual MAX98357A
# I2S DAC+amp. Same native USB-Serial-JTAG console as the other S3 boards.
CONFIG_IDF_TARGET="esp32s3"

# 8 MB flash + 8 MB OCTAL PSRAM, matching the Amped-ESP32-S3-Plus (same audio-dock
# module family). UNVERIFIED on this specific board — if it boot-loops with a flash
# size / PSRAM mismatch, adjust FLASHSIZE / SPIRAM_MODE here (these are baked into
# the image and can't be re-provisioned over USB).
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Console + stdio over the built-in USB-Serial-JTAG CDC port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Board selection (boards/board.h + default pin map).
CONFIG_ENSEMBLE_BOARD_ESP32S3_LOUD=y

# PSRAM: octal, auto-size, 80 MHz (players are PSRAM-only — docs/developer/esp32.md §3.1).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
